Repository: mozilla-l10n/mt-training-data
Catalog: khw/khw_pontoon.tmx
Source language: en_us
Languages: khw

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
khw: کار کوریکو موژی، جام غورو سورا چیک کو،کیاٰغ کی رکارڈ بیتی شیر نیویشیرو دی اسیتان؛ معمولی غلطی دی کی اوشوئے رد کو۔ <br /> بو عام غلطیاں موژی ہمیت شامل شینی:

source: When you request your recordings, we compile them into one or multiple ZIP files. Here are your past requests:
khw: تو تان رکارڈنگان پچین درخواست کی ارو، اسپہ ہیتان ای ژاغا انگوسی یا امبوخ زیب فائلا۔ تہ پرانو درخواست ہیا بونی

source: Which variant of { $language } do you speak?
khw: تو کیا ژاغو { $language } وارو کوسان؟

source: Why ?
khw: کو؟

source: Why a profile?
khw: پروفائل کو

source: Why are you asking?
khw: تو کو بشار کوسان؟

source: Why Common Voice?
khw: کامن وائس کو ضروری؟

source: Why does this matter?
khw: ہیا اہم کو؟

source: Why we built this Spontaneous Speech prototype
khw: اسپہ ہیہ سپونٹینئس اسپیچو ای نمونہ کو ساوزیسیان؟

source: With a profile, you can keep track of your activity and connect with a community of voice data contributors.
khw: پروفائلو سورا ، کندوری کوروم ارو، رے پتہ کوس۔ تان ہوازان دیاک رویان سوم رابطہ بہچوس۔

source: Wixarika
khw: ویکساریکا

source: Wixárika
khw: ویکزا ریکا

source: Wolof
khw: ولوف

source: Would you like to request your voice recordings be deleted too, or do you prefer to keep them in the Common Voice dataset?
khw: تو تان محفوظ بیرو ہوازو بوغیک مݰکیسانا یا کامن وائسا لکھیک مݰکیسان

source: Write
khw: نیویشے

source: Write down exactly what the person said, including placeholder words like 'um', or 'errr'.
khw: ہتے قسمہ نیویشے کیچہ کی ریتائے، ژاغا گاناکان 'اوم' یا 'ایر' قسمہ ہوازان دی شامل کو۔

source: Write down what you hear the person saying here
khw: کیاغ کی کار ارو توغو ہیہ نیویشے

source: Write options menu
khw: اختیاراتان فہرستو نیویشے

source: Xhosa
khw: زوسا

source: Xitsonga
khw: زیتاسونگا

source: y
khw: وائی

source: Yaqui
khw: یاقوی

source: Yes
khw: دی لہ

source: Yes, send me emails. I’d like to stay informed about the Common Voice Project.
khw: دی، متین ای میل انځاوے۔ اوا کامن وائسو پروجیکٹو بارا معلومات گنیگو جاری سوتیک مݰکیمان۔

source: Yes, send me emails. I'd like to stay informed about the progress of this language on Common Voice.
khw: دی، متین ای میل انځاوے۔ اوا کامن وائسا ہیا وارا کورمو بارا معلومات گنیگو جاری سوتیک مشکیمان۔

source: Yiddish
khw: یدیش

source: Yoruba
khw: یوروبا

source: You
khw: تہ

source: You are about to initiate a download of <size>{ $size }GB</size>, proceed?
khw: تو <size>{ $size } جی بی </size>ڈاون لوڈ شروع کوسان، پروشٹی بی سانا؟

source: You are prepared to initiate a download of <b>{ $size }</b>
khw: تو ہموغار<b>{ $size }</b> ڈاون لوڈ شروغیکو بچین تیار اسوس

source: You can add sentences on the <writePageLink>Write page</writePageLink> or review sentences on the <reviewPageLink>Review page</reviewPageLink>.
khw: تو جملان <writePageLink>نیویشکو صفحہ</writePageLink>شامل کوریکو بوس۔ یا <reviewPageLink> وا لوڑیکو صفحہ<reviewPageLink> بی سہی گیری لوڑے۔

source: You can also copy and paste the direct URLs into your favorite download manager. They will expire in 12 hours, but you can come back to this page to generate new ones any time.
khw: تو ڈئرکٹ یو آر ایلو دی تان خوش ڈاون لوڈ منیجرا کاپی پیسٹ کوریکو بوس۔ ہتیت 12 گھنٹہ ختم بونی، لیکن تو ہیہ صفحہ اچی گیتی نوغ شروع کوریکو بوس۔

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
khw: تو کیبورڈ شارٹ کٹ استعمال کوریکو بوس{ sc-review-form-button-approve-shortcut } منظور کوریکو پچین{ sc-review-form-button-reject-shortcut } رد کوریکو پچین { sc-review-form-button-skip-shortcut } پیځیکو پچین

source: You can choose to make your username public or anonymous.
khw: تو تان استعمال بک نامو وریع یا کھوشتیکو بوس۔

source: You can go to the <datasetsPage>datasets page</datasetsPage>, select the version and language(s) you want, and download it! The files have <metadataLink>associated metadata</metadataLink>, such as demographic information and validation data. You’ll need to provide an email address to download the dataset.
khw: تو ڈیتا بیسا<datasetsPage> بیکو بوس۔ ورژنو اوچے وارو گنے کھیوکی تو مݰکیسان وا ہورو ڈاون لوڈ کو۔ ہے فائلو سون <metadataLink> چوکیرو لوٹ دیٹا شیر</metadataLink>، آبادیو وا تصدیقو معلومات شینی۔ ڈونلوڈ کوریکو پچین تہ تان ای میلو دیلیک بوئے۔

source: You can help build a diverse, open-source dataset by creating a Common Voice profile and contributing your voice.
khw: تو مختلف قسما مدد کوریکو بوس۔ پروفائل ساوزے وا تان ہوازو کی مہربانی ارو سفو بچین ڈیٹا سیٹ ساوز بوئے۔

source: You can meet others in the Mozilla language communities by joining <discourseLink>Discourse</discourseLink> for topical conversations, or <matrixLink>Matrix</matrixLink> for quick advice.
khw: تو موزیلو وران ڈالو خور رویان سوم ملاو بیتی ای موضوعو بارا لودیکو بچین ہیہ <discourseLink> مشقولگیا</discourseLink> شامل بوس یا ݰاؤ مشورہ گنیکوبچین <matrixLink> ہیہ خانہ </matrixLink> گے۔

source: You cannot add multiple sentences for a single submission
khw: تو ای وحتا امبوخ جملان شامل کوریکو نو بوس

source: You cannot request your recordings while another request is already in progress.
khw: تو تان رکارڈنگ پچین ریکو نو بوس کہ ای خور رکارڈنگ بااوشتائے

source: You can request a new takeout of your recordings every { $days } days.
khw: تو ہار { $days } بسا تان رکارڈنگو گنی الیکو بچین درخواست کوریکو بوس

source: You can run events to help people contribute. It’s easier than you think. You could do it online with a videoconferencing tool, or in person if it’s safe. <eventTemplate>Check out our templates and resources for running events</eventTemplate>.
khw: تو رویان شرکت کوریکا مدد کوریکو پچین میٹنگ مشکیکو بوس۔ ہیا بو اسان۔ اونلائن ویڈیو کانفرنسو ذریعہ کوریکو بوس یا کیا خطرہ کی نو اشوئی تیتان ای ژاغا مشکی دی کوری بوس۔ <eventTemplate> میٹنگو ضروری اشناریان پیچین ہمو </eventTemplate>لوڑے

source: You can <sentenceCollectorLinkAdd>add small numbers of sentences</sentenceCollectorLinkAdd>, or you can do <bulkImportDocsLink>bulk imports using Github</bulkImportDocsLink>. Remember that sentences need to be <licenseLink>CC0 (or public domain)</licenseLink>, or you can write your own.
khw: تو ای کمہ <sentenceCollectorLinkAdd>جملان شامل</sentenceCollectorLinkAdd> کوریکو بوس۔ یا </bulkImportDocsLink>گیٹ ہبو </bulkImportDocsLink> استعمال کوری امبوخ جملان اندرینی انگیو بوس۔ یاد سوتے جملہ <licenseLink> سی سی سی زیرو (عام رویان استعمالو دائرو )</licenseLink> بیک ضروی، یا تان دی نیویشے۔

source: You can use the <scraperLink>Sentence extractor</scraperLink> to leverage short sentences from Wikipedia.
khw: تو ویکیپیڈیار اسکوردی جملان نیزیکو بچین جملہ نیزاکو<scraperLink> دی استعمال کوریکو بوس

source: You check whether the transcription matches the audio
khw: چیک کوکی نیویشیرو اوچے ہواز ای قسمہ؟

source: You could include the website, e.g "Common Voice - https://commonvoice.mozilla.org/"
khw: تو ویب سائٹو دی شامل کوریکو بوس مثلا "کامن وائس https://commonvoice.mozilla.org/""

source: You could use academic referencing style, e.g Harvard style "Mozilla (2021) Common Voice. Available at https://commonvoice.mozilla.org/ (Accessed: 15th September 2021)"
khw: تو تحقیقی حوالہ دیکو اندازا استعمال کوریکو بوس مثلا ہارڈوڈو انداز، موزیلا (2021) کامن وائسو انداز۔ ہیا https://commonvoice.mozilla.org/ ژاغا شیر (توریتائی:15 ستمبر 2021۱)

source: You could use social media platforms to get the message out. Share posts that explain why it matters, and get in touch with other people talking about issues like language rights, voice AI, or bias in tech. See more advice on <campaignLink>running a social campaign, including content you can re-use</campaignLink>.
khw: رویان کارا تاریکو بچین تو شوشل میڈیو اسعمال کوریکو بوس۔ ہݰ پوسٹ کوکی ہیہ کو اہم، وا خور رویان تین وارو حقوقان، ہوازو اے آئی، یا ٹیکنالوجیا تعاصبو بارا لوو دیت۔ سوشل میڈیا چلیکو خور مشوران بچین ہیہ ژاغا<campaignLink> لوڑے۔ ہیرا دی اشناری شینی تو کی استعمال کوسان۔

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
khw: تو کیہ وارو نو گنیتاو۔ وارو گنیکوبچین، مہربانی کوری تان <profileLink> پروفائلا </profileLink> بوغے۔

source: You have reached the submission limit for this page. Please wait for { $retryLimit } minutes before submitting another sentence. Thank you for your patience!
khw: ہیا صفحہ جمع کوریکو تعدادو پورا ارو۔مہربانی کوری خور جملو جمع کوریکار پروشٹی { $retryLimit } منٹ انتظار کو۔ صبر کوریکو بچین شکریہ!

source: You have reached the submission limit for this page. Please wait for { $retryLimit } seconds before submitting another sentence. Thank you for your patience!
khw: ہیا صفحہ جمع کوریکو تعدادو پورا ارو۔ مہربانی کوری خور جملو جمع کوریکار پروشٹی { $retryLimit } سیکنڈ انتظار کو۔ صبر کوریکو بچین شکریہ!

source: You have unsaved changes on this page. If you change the locale, your changes will not be saved. Are you sure you want to change the locale?
khw: ہیا صفحہ بدیل دیکر اچی محفوظ نو بیتی شیر۔ تو کی ترجمان بدیل پراو، بدیل دیرو محفوظ نو بونی۔ تو یقیناً ترجمان بدیل دوسانا؟

source: You have unsaved changes on this page. If you leave this page, your changes will not be saved. Are you sure you want to leave this page?
khw: ہیا صفحہ بدیل دیکر اچی محفوظ نو بیتی شیر۔ ہیا صفحو کی پیڅیتاؤ بدیل دیرو محفوظ نو بونی۔ تو یقیناً ہموپیچوسان؟

source: You must allow microphone access.
khw: تہ مائیکو ہیرو توریکو لاکیلیک

source: You need to be able to hear every word of the recording. We want machine learning algorithms to be able to handle a variety of background noise, and even relatively loud noises or quiet background music can be accepted provided that they don’t prevent you from hearing the entirety of the text. Crackles or ‘breaking up’ that prevent you hearing the text means you should reject the clip.
khw: رکارڈ بیرو ہر لفظ تہ کارا سفا دیار۔ اسپہ ہݰ مݰکیسیان کہ مشینو ݯیݯیکو حساب کتاب مختلف قسمہ گوݯتو ہوازن سنبال کوریکو قابلا بائے۔ پھوک ذیاد تھوڑ ہواز یا بو لاش گوݯتو بشاونو کی اوشوئے تغور منظور کوین بوئے بشرط کی ہسے تا سف عبارتو ریکا رکاوٹ نواریر۔ گوݯتو خور ہواز کار کوریکو کی رکاوٹ کوراواشتائے توغو رد کو۔

source: Your accent is the way you pronounce words. It can be shaped by where you have lived, which other languages you speak and lots of other factors. You can share any information you feel is relevant here.
khw: تو لفظان کیا طریقہ کی ادا کوسان ہسے تہ لہجہ۔ کیا ژاغا کی تو حال بیتی استاو ہسے، کندری واران تو کی کوسان ہتیت وا خور دی بو اشناری ہمو تین شکل دیکو بونی۔ تو کیادی معلوماتو ہوروتین ضروری جݰوسان تیتا ن خوروسو کارا تاراوے

source: Your anonymous voice recordings will remain in the Common Voice dataset. Once you delete your profile you will no longer be able to submit a request to remove your recordings from the dataset
khw: تہ ہوازو ریکارڈ کامن وائسا کھوشت بہچور۔تو تان پروفائلو کی بوغیتاو معلوماتان موژار تان ہوازو نیزیکو درخواست کوریکو نو بوس

source: Your daily goal has been created
khw: تہ انوسو حدف ساوز ہوئے

source: Your dataset is downloading!
khw: تہ ڈیٹاسیٹ ڈاون لوڈ بویان

source: Your download has started.
khw: تہ ڈاون لوڈ شروع ہوئے

source: You’re contributing to a target segment
khw: تو ای حدافو پورا کوریکوبچین کوروم کوسان

source: You’re contributing to our first target segment
khw: تو اسپہ اولو مقصدو کورمو کوریکا اسپہ مددو کوسان

source: You're currently set to <bold>NOT</bold> receive emails such as goal reminders, my progress updates and newsletters about Common Voice
khw: موجودہ وختا تہ سیٹنگ ہݰ شیر<bold>نو </bold> کہ تہ تین تہ مقصدو یاد کوریکو، تہ کورمو اپڈیٹ، وا کامن وائسو بارا نیوز لیٹر گونی۔

source: You're currently set to receive emails such as goal reminders, my progress updates and newsletters about Common Voice
khw: موجودہ وختا تہ سیٹنگ ہݰ شیر کہ تہ تین تہ حدفو یاد کوریکو بچین ای میل گونی۔

source: You're going too fast. Please take a moment to review the sentence to make sure it's correct.
khw: تو تیز اسوس۔ مہربانی کوری جملو وا لوڑے بچین پھوک وخت گنے، تسلی کوکی سہی شیر۔

source: You're helping Common Voice reach our daily sentence goals!
khw: تو کامن وائسو ہرانوسو جملان پورا کوریکا مدد کوسان

source: Your email address
khw: تہ ای میلو پتہ

source: You respond or reply to it as naturally as you can
khw: ہمو تین تا جواب کندوری کی ہوئے قدرتی بیلیک

source: Your files are being assembled. Please check again later.
khw: تہ فائل ای ژاغا ہانی۔ مہربانی کوری پھوک اچا چیک کو۔

source: Your Languages
khw: تہ وار

source: Your language variant might be out of clips! If you’re comfortable, you can change your settings to see other sentences within your language.
khw: تہ وارو ہواز ختم بیرو بونی! تان وارو خور جملان لوڑیکو بچین، کی بوسان ترتیبو بدل دیکو بوس۔

source: Your language variant might be out of sentences! If you’re comfortable, you can change your settings to see other sentences within your language.
khw: تہ وارو جملہ ختم بیرو بونی۔ کی بوسان تان وارا خور جملان لوڑیکو بچین تان ترتیبو بدل کوریکو بوس۔

source: Your username and email will not be associated with the published data.
khw: تا استعمال بیرو نام وا ای میل پبلیش بیرو معلوماتان سون جوس نو بوئی

source: Your weekly goal has been created
khw: تہ ہفتہ وار حدف ساوز ہوئے

source: You should receive an email shortly explaining the steps to get your language added to Common Voice
khw: شاؤ تہ تین ای امیل گیلیک، ہتیرا تہ وارو کامن وائسا شامل کوریکو مراحل شینی

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
khw: کامن وائسو انوسو <goalPercentage></goalPercentage> { $goalValue } رکارڈو پورا کوریکا مدد ارو

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
khw: کامن وائسو ای انوسو <goalPercentage></goalPercentage> { $goalValue } تصدیق کوریکو حدفو پورا کوریکا مدد ارو

source: You've successfully signed up for contributing to { $language }. Thank you.
khw: تو { $language }مدد کوریکو پچین کامیابیو سورا سائن اب ہو۔ شکریہ

source: You want to join the Common Voice mailing list
khw: تو کامن وائسو رابطو فہرستا شامل بیک مݰکیسانا؟

source: You write down what you hear in the audio clips
khw: ہتوغو نیویشے کیاغ کی ہوازا کار ارو

source: Zaza
khw: زارا

source: Zip #{ $offset } of { $total }
khw: { $total } موژار زیپ نمبر{ $offset }

source: Zulu
khw: زولو

source: account recovery key
khw: اکاونٹو جوبارہ انگیکو نمبر

source: add-on
khw: اضافی سافٹ وئیر

source: alternate text
khw: متبادل نیویشرو

source: attack
khw: حملہ

source: attacker
khw: حملہ کوراک

source: Attack Site
khw: حملو ژاغہ

source: attendee
khw: حاضر باک

source: authenticate
khw: تصدیق

source: authenticated
khw: سہی جوݰینو بیرو

source: authentication code
khw: تصدیق کوریکو نمبر

source: autoplay
khw: تنارتان چولاک

source: backup authentication code
khw: محفوظ کوریکو مستند نمبر

source: bookmark
khw: نݰان

source: breakpoint
khw: چھیکو بیچان

source: Bug report
khw: نقصو رپورٹ

source: certificate authority
khw: سند دیاک

source: cipher
khw: کھوشت خط

source: clipboard
khw: گتھہ

source: colorway
khw: رنگین راہ

source: confirmation code
khw: تصدیقی نمبر

source: context
khw: حالات

source: cookie banner
khw: کوکیزان نݰان

source: corrupt
khw: خراب

source: corrupted
khw: خراب بیرو

source: crash
khw: جازیر

source: cross-site tracking cookie
khw: کھاڑ ویلٹی لوڑاک کوکیز

source: cryptominer
khw: کرپٹو مائنر

source: cryptomining
khw: کرپٹو مائنیگ

source: debug
khw: عیبو دودیری کوریک

source: deceptive site
khw: غیر محفوظ سائٹ

source: decode
khw: ویریغ

source: decryption
khw: کھولاو کوریک

source: disinformation
khw: اباتھہ معلومات

source: distrust
khw: بے اعتمادی

source: email mask
khw: ایمیلو پردانج

source: enable
khw: قابل ساوزیک

source: encode
khw: کوڈ لاگیک

source: encrypt
khw: کوڈ لاگیک

source: encryption
khw: کھوشتیک

source: end user
khw: کورما انگیاک

source: Enhanced Tracking Protection
khw: مݰکیکو حفاظتو ذیاد اریر

source: extension
khw: کھولاؤ

source: fingerprinter
khw: چموٹ ݯھاکیاک

source: fingerprinting
khw: چموٹ ݯھاکئیک

source: Firefox View
khw: فائر فاکسو منظر

source: grassroots
khw: شروغ

source: home page
khw: اولانو موخ

source: import
khw: بیریار انگیک

source: independent browser
khw: آزاد پاشیاک

source: innovations
khw: تخلیقی کوروم

source: insecure
khw: غیر محفوظ

source: installation
khw: ہو دریک

source: Issue
khw: نقص

source: Legacy extension
khw: میراث الیک

source: MDN
khw: ایم ڈی این

source: misinformation
khw: غلط معلومات

source: native
khw: بومکی

source: net neutrality
khw: پورا کوس سوری نو

source: nonprofit
khw: منافع نو شیرو

source: non-profit
khw: منافع نو شیرو

source: open source
khw: سفو بچین ذرائع

source: override
khw: ژاغو گنیک

source: phone number mask
khw: فون نمبرو پردانچ

source: pop-up
khw: سورا نیزیک

source: preference
khw: پروشٹی

source: Privacy Notice
khw: راز داری پالیسی

source: release
khw: جاری کوریک

source: report
khw: رپورٹ کو

source: restricted site
khw: پابند سائٹ

source: revert
khw: اچی گیک

source: Review checker
khw: واڑوڑیکو چیک کوراک

source: search suggestion
khw: مݰکیکو تجویز

source: security keys
khw: محفوظ کوریکو نمبر

source: sensitive
khw: حساس

source: sidebar
khw: گوݯو ٹھون

source: sign
khw: سائن اِن

source: signer
khw: باشیاک

source: sign in
khw: داخل بیک

source: sign-in
khw: سائن-اِن

source: studies
khw: سبق

source: Terms of Service
khw: استعمالو شرط

source: track
khw: روغ

source: trackers
khw: روغین بوغاک

source: Tracking Content
khw: اشناریان معلوم کوریک

source: unencrypted
khw: ویریع

source: unresponsive
khw: چوم چوقوت

source: unsafe
khw: غیر محفوظ

source: validate
khw: توثیق کوریک

source: validity
khw: توثیق

source: version
khw: ورژن

source: Web Authentication
khw: مستند ویب
